"""
Завдання №2

Потрібно визначити, чи є даний рік високосним. Нагадаємо, що високосними
роками вважаються ті роки, порядковий номер яких або кратний 4, але при
цьому не кратний 100, або  кратний 400 (наприклад, 2000-й рік був
високосним, а 2100-й буденевисокосним роком). Програма повинна коректно
працювати на числах 1900 ≤ n ≤ 3000. Виведіть Leap year. в разі, якщо рік
є високосним, і Ordinary year. у протилежному випадку.

Автор: Костючик Валерія Дмитрівна

"""

rik = int(input("Введіть рік: "))

if rik >= 1900 and rik <= 3000:

    if rik % 4 == 0 and rik % 100 != 0 or rik % 400 == 0:
        print("Leap year")
    else:
        print("Ordinary year")
else:
    print("Ancorrect")
